In [1]:
# time series is a data set where values are measured at different points in time

In [2]:
import pandas as pd

In [5]:
my_data = pd.read_csv("IMDB-Movie-Data.csv")
my_data.head(4)

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0

In [13]:
# read data types
my_data.dtypes

Rank                    int64
Title                  object
Genre                  object
Description            object
Director               object
Actors                 object
Year                    int64
Runtime (Minutes)       int64
Rating                float64
Votes                   int64
Revenue (Millions)    float64
Metascore             float64
dtype: object

In [15]:
# read years 
my_data[["Year"]]

     Year
0    2014
1    2012
2    2016
3    2016
4    2016
..    ...
995  2015
996  2007
997  2008
998  2014
999  2016

[1000 rows x 1 columns]

In [17]:
# read runtime 
my_data[["Runtime (Minutes)"]]

     Runtime (Minutes)
0                  121
1                  124
2                  117
3                  108
4                  123
..                 ...
995                111
996                 94
997                 98
998                 93
999                 87

[1000 rows x 1 columns]

In [19]:
my_data = my_data.set_index("Date")
my_data

KeyError: "None of ['Date'] are in the columns"